{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-SYMPTOM",
    "2": "I-SYMPTOM",
    "3": "B-CONDITION",
    "4": "I-CONDITION",
    "5": "B-TREATMENT",
    "6": "I-TREATMENT",
    "7": "B-MEDICATION",
    "8": "I-MEDICATION"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-CONDITION": 3,
    "B-MEDICATION": 7,
    "B-SYMPTOM": 1,
    "B-TREATMENT": 5,
    "I-CONDITION": 4,
    "I-MEDICATION": 8,
    "I-SYMPTOM": 2,
    "I-TREATMENT": 6,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "vocab_size": 30522
}
